Tekla.Structures.ModelInternal.dotClash_t
Struct for the ClashCheck.

Tekla.Structures.ModelInternal.dotClash_t.Id1
ID of the first clashing object.

Tekla.Structures.ModelInternal.dotClash_t.Id2
ID of the second clashing object.

Tekla.Structures.ModelInternal.dotClash_t.Type
Type of Clash. One of ClashTypeEnum.

Tekla.Structures.ModelInternal.dotClash_t.PenetrationDepth
Penetration depth of the clash. Min 0.2 mm = 0.0002 PenetrationDepth, Max
200.0 mm = 0.200 PenetrationDepth. Can be 0.0 if penetration depth could not be calculated.